<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b84e569e94af8dfcc75cd6faa72402fe97503f9fc696df186e9765f3f483b1d4","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #795 at https://github.com/cal-itp/data-infra/actions/runs/18536123187","plan_out_hash":"c3d56518f55f0d4701c1ed385b05d7424da00e65bed82ceb498db65f7ae5b3e0","plan_hash":"fa8b5ac8badda0ecb22265b57d3cc4761867a42c535abbe7e5b7136f8aebad32","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "tw/PDA==" -> (known after apply)
!~      detect_md5hash      = "uot1EZn5rUvHVOnT+IrFbg==" -> "different hash"
!~      generation          = 1759879834798239 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "uot1EZn5rUvHVOnT+IrFbg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "OKgqdg==" -> (known after apply)
!~      detect_md5hash      = "MmLomX54bM3skMX0CTrXtA==" -> "different hash"
!~      generation          = 1759879836518711 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "MmLomX54bM3skMX0CTrXtA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #795](https://github.com/cal-itp/data-infra/actions/runs/18536123187)